In [1]:
import pandas as pd

# Cek versi
print(pd.__version__)

1.3.4

Untuk membuat dataframe dari hasil seleksi spreadsheet/ excel, kita hanya perlu menaruh seleksi tadi kedalam clipboard kemuadian copy pada data yang telah diseleksi dan baris pertama dari hasil seleksi akan dijadikan nama kolom.

In [3]:
df = pd.read_clipboard()
df

       NIM                 Nama
0  2173008         Owen William
1  2173014           Dwiyanto H
2  2173013        Ryo Ferdianto
3  2173005  Matthew Christopher
4  2173001             Nicovan